[
    {
        "name" : "SCP-235",
        "gitURL" : "https://github.com/MrMarrant/SCP-235",
        "otherUrl" : {
            "steam" : "https://steamcommunity.com/sharedfiles/filedetails/?id=2980228292",
            "gmodstore" : null
        },
        "iconePath" : "images/scp-235.gif",
        "languageCode" : "LUA",
        "releaseDate" : "2023-30-07",
        "shortDescription" : "SCP-235 appear to be shellac phonograph records of the type commonly produced in the late 1920s.",
        "longDescription" : "Each record contains a different song.\nIts main effect is to stop in time all nearby entities whenever the record 'skips'.\nCaution, you cannot remove a CD when a 'skip' is in progress.\nA gramophone is provided with the vinyl records to play them, each record plays a different sound."
    },
    {
        "name" : "PortFolio",
        "gitURL" : "https://github.com/MrMarrant/mrmarrant_website",
        "otherUrl" : {
            "steam" : null,
            "gmodstore" : null
        },
        "iconePath" : "images/mrmarrant_pdp.png",
        "languageCode" : "PHP | HTML | CSS",
        "releaseDate" : "2023-09-04",
        "shortDescription" : "C'est un Chien",
        "longDescription" : "C'est un Chien"
    },
    {
        "name" : "Aegis-Infection",
        "gitURL" : "",
        "otherUrl" : {
            "steam" : null,
            "gmodstore" : "https://www.gmodstore.com/market/view/aegis-infection"
        },
        "iconePath" : "images/aegis-infection.png",
        "languageCode" : "Lua",
        "releaseDate" : "2023-09-05",
        "shortDescription" : "Aegis Infection is an infection addon to perform actions with the purpose of simulating a zombie infection.",
        "longDescription" : "Aegis Infection is designed to simulate a zombie infection.\nThe addon is highly configurable via a menu accessed through a command.\nUsers can change the models of the infected players based on their job.\nYou can specify which jobs or models are immune to infection and edit basics statistics."
    },
    {
        "name" : "Project-SCRAMBLE",
        "gitURL" : "https://github.com/MrMarrant/Project-Scramble",
        "otherUrl" : {
            "steam" : "https://steamcommunity.com/sharedfiles/filedetails/?id=2988971057",
            "gmodstore" : null
        },
        "iconePath" : "images/project-scramble.gif",
        "languageCode" : "Lua",
        "releaseDate" : "2023-01-01",
        "shortDescription" : "SCRAMBLEs are NVG goggles that (in theory) censor the face of the SCP-096 object.\nA black 3D element will appear in place of SCP-096's face.",
        "longDescription" : "The SCRAMBLE adapts to the entity's model ..."
    },
    {
        "name" : "SCP-035",
        "gitURL" : "https://github.com/MrMarrant/SCP-035",
        "otherUrl" : {
            "steam" : "https://steamcommunity.com/sharedfiles/filedetails/?id=3012509914",
            "gmodstore" : null
        },
        "iconePath" : "images/scp-035.gif",
        "languageCode" : "Lua",
        "releaseDate" : "2023-07-30",
        "shortDescription" : "SCP-035 appears to be a white porcelain comedy mask.\nHumanoid subjects of SCP-035, or in visual contact with it, experience a strong urge to put it on.",
        "longDescription" : "When SCP-035 is placed on the face of an individual, an alternate brain wave pattern from SCP-035 overlaps that of the original host, effectively snuffing it out and causing brain death to the subject.\nSubject then claims to be the consciousness contained within SCP-035.The aim of this addon was to remake the SCP-035 entity in its entirety, but with more immersive effects, in a desire to bring the experience closer to the original."
    },
    {
        "name" : "Real-Garbage",
        "gitURL" : "https://github.com/MrMarrant/Real-Garbage",
        "otherUrl" : {
            "steam" : "https://steamcommunity.com/sharedfiles/filedetails/?id=3001573745",
            "gmodstore" : null
        },
        "iconePath" : "images/real-garbage.gif",
        "languageCode" : "Lua",
        "releaseDate" : "2023-07-09",
        "shortDescription" : "Real garbage is an addon containing two (pretty) garbage can entities and one generator of trash.",
        "longDescription" : "Inside the garbage cans, you can store all sorts of different entities, props and even NPCs you'd like to silence.\nYou can, of course, remove their containers one by one, using the action button on the garbage can, which will remove the waste that was added last in order.\nThey each have a maximum capacity, as well as life statistics, so they can be destroyed, resulting in the expulsion of all trashs.\nThe generator ... generate trash with what ever you fill it.\nIt display the current state of the generator on screen.\nThey are all animated, with customized sounds for physics, damage received, or when adding/removing trash.\nIf you take good care of them, they'll return the favor UwU"
    }
]